Revit 2027 API
Document.IsDefaultElementTypeIdValid Method
 Checks whether the element type id is valid for the give DefaultElmentType id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDefaultElementTypeIdValid(
	ElementTypeGroup defaultTypeId,
	ElementId typeId
)
Public Function IsDefaultElementTypeIdValid (
	defaultTypeId As ElementTypeGroup,
	typeId As ElementId
) As Boolean
public:
bool IsDefaultElementTypeIdValid(
	ElementTypeGroup defaultTypeId,
	ElementId^ typeId
)
member IsDefaultElementTypeIdValid :
        defaultTypeId : ElementTypeGroup *
        typeId : ElementId -> bool
Parameters
defaultTypeId ElementTypeGroup
 The default element type id.
typeId ElementId
 The element type id.
Return Value
Boolean
 True if the element type id is valid for the give DefaultElmentType id, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace